# api.R
library(plumber)
# ---------------------------------------------------------------------------- #
#' masas
#' @description Lunar month in the Vedic calendar system
masas <- c(
"वैशाख", 
"जेष्ठ", 
"आषाढ़", 
"श्रावण", 
"भाद्र", 
"आश्विन", 
"कार्तिक", 
"मंसिर", 
"पौष", 
"माघ", 
"फागुन", 
"चैत्र"
)

# ---------------------------------------------------------------------------- #
#' tithis
#' @description lunar day in the Vedic calendar system
tithis <- c(
"१--प्रतिपदा--शुक्लपक्ष",
"२--द्वितीया--शुक्लपक्ष",
"३--तृतीया--शुक्लपक्ष",
"४--चतुर्थी--शुक्लपक्ष",
"५--पञ्चमी--शुक्लपक्ष",
"६--षष्ठी--शुक्लपक्ष",
"७--सप्तमी--शुक्लपक्ष",
"८--अष्टमी--शुक्लपक्ष",
"९--नवमी--शुक्लपक्ष",
"१०--दशमी--शुक्लपक्ष",
"११--एकादशी--शुक्लपक्ष",
"१२--द्वादशी--शुक्लपक्ष",
"१३--त्रयोदशी--शुक्लपक्ष",
"१४--चतुर्दशी--शुक्लपक्ष",
"१५--पूर्णिमा--शुक्लपक्ष",
"१६--प्रतिपदा--कृष्णपक्ष",
"१७--द्वितीया--कृष्णपक्ष",
"१८--तृतीया--कृष्णपक्ष",
"१९--चतुर्थी--कृष्णपक्ष",
"२०--पञ्चमी--कृष्णपक्ष",
"२१--षष्ठी--कृष्णपक्ष",
"२२--सप्तमी--कृष्णपक्ष",
"२३--अष्टमी--कृष्णपक्ष",
"२४--नवमी--कृष्णपक्ष",
"२५--दशमी--कृष्णपक्ष",
"२६--एकादशी--कृष्णपक्ष",
"२७--द्वादशी--कृष्णपक्ष",
"२८--त्रयोदशी--कृष्णपक्ष",
"२९--चतुर्दशी--कृष्णपक्ष",
"३०--अमावस्या (औंसी)--कृष्णपक्ष"
)

# ---------------------------------------------------------------------------- #
#' nakshatras
#' @description Name of the 27 Nakshatras in Vedic calendar system
nakshatras <- c(
 "अश्विनी",
"भरणी",
"कृत्तिका",
"रोहिणी",
"मृगशिरा",
"आर्द्रा",
"पुनर्वसु",
"पुष्य",
"आश्लेषा",
"मघा",
"पूर्वाफाल्गुनी",
"उत्तराफाल्गुनी",
"हस्त",
"चित्रा",
"स्वाति",
"विशाखा",
"अनुराधा",
"ज्येष्ठा",
"मूला",
"पूर्वाषाढा",
"उत्तराषाढा",
"श्रवण",
"धनिष्ठा",
"शतभिषा",
"पूर्वाभाद्रपदा",
"उत्तराभाद्रपदा",
"रेवती"
)

# ---------------------------------------------------------------------------- #
#' ritus
#' @description Name of the 6 seasons in Vedic calendar system
ritus <- c(
  "Vasanta",
  "Grishma",
  "Varsha",
  "Sharad",
  "Hemanta",
  "Sishira"
)

# ---------------------------------------------------------------------------- #
#' samvatsars
#' @description Name of the Year in Hindu Panchang
samvatsars <- c(
  "प्रभव",
"विभव",
"सुक्ल",
"प्रमोद",
"प्रजापति",
"अङ्गिरस",
"श्रीमुख",
"भाव",
"युवा",
"धात्री",
"ईश्वर",
"बहुधन्य",
"प्रमाधी",
"विक्रम",
"वृषप्रज",
"चित्रभानु",
"सुभानु",
"तरण",
"पार्थिव",
"व्यय",
"सर्वजित",
"सर्वधारिण",
"विरोधिन",
"विकृत",
"खर",
"नन्दन",
"विजय",
"जय",
"मन्मथ",
"दुर्मुखी",
"हेविलम्बी",
"विलम्बी",
"विकारी",
"शरवरी",
"प्लव",
"शुभकृत",
"शोभाकृत",
"क्रोधी",
"विश्ववासु",
"पराभव",
"प्लवङ्ग",
"किलक",
"सौम्य",
"साधारण",
"विरोधाकृत",
"परिधावी",
"प्रमादी",
"आनन्द",
"राक्षस",
"नला",
"पिङ्गला",
"कालायुक्त",
"सिद्धार्थी",
"रौद्र",
"दुरमती",
"दुन्दुभी",
"रुधिरोद्धार",
"रक्ताक्षी",
"क्रोधना",
"अक्षय"
)

# ---------------------------------------------------------------------------- #
#' yogas
#' @description Name of the 27 yogas which is sum of sidereal longitudes of sun and moon in the multiples of 13 degrees 20 minutes
yogas <- c(
"विश्खम्भ",
"प्रिति",
"आयुष्मान",
"सौभाग्य",
"शोभना",
"अतिगण्ड",
"सुकर्मन",
"धृति",
"शूल",
"गण्ड",
"वृद्धि",
"ध्रुवा",
"व्याघाता",
"हर्षण",
"वज्र",
"सिद्धि",
"व्यतिपात",
"वरियन",
"परिघ",
"शिव",
"सिद्ध",
"साध्य",
"शुभ",
"सुक्ल",
"ब्रह्मा",
"इन्द्र",
"वैधृत"
)

# ---------------------------------------------------------------------------- #
#' karanas
#' @description Name of 60 Karanas which is when moon traverses 6° in longitude relative to the sun
karanas <- c(
 "किम्स्तुघ्न",
"बावा",
"बालव",
"कौलव",
"तैतीला",
"गरज",
"वाणिज",
"विस्ति",
"बावा",
"बालव",
"कौलव",
"तैतीला",
"गरज",
"वाणिज",
"विस्ति",
"बावा",
"बालव",
"कौलव",
"तैतीला",
"गरज",
"वाणिज",
"विस्ति",
"बावा",
"बालव",
"कौलव",
"तैतीला",
"गरज",
"वाणिज",
"विस्ति",
"बावा",
"बालव",
"कौलव",
"तैतीला",
"गरज",
"वाणिज",
"विस्ति",
"बावा",
"बालव",
"कौलव",
"तैतीला",
"गरज",
"वाणिज",
"विस्ति",
"बावा",
"बालव",
"कौलव",
"तैतीला",
"गरज",
"वाणिज",
"विस्ति",
"सकुनी",
"चतुष्पद",
"नाग"
)

# ---------------------------------------------------------------------------- #
#' rashis
#' @description The name of 12 Rashis which represents the position of the moon on the zodiac at a given time
rashis <- c(
"मेष",
"वृषभ",
"मिथुन",
"कर्कट",
"सिंह",
"कन्या",
"तुला",
"वृश्चिक",
"धनु",
"मकर",
"कुम्भ",
"मीन"
)

# ---------------------------------------------------------------------------- #
#' vaaras
#' @description Name of the day of the week
vaaras <- c(
"आइतबार",
"सोमवार",
"मंगलवार",
"बुधवार",
"बिहिवार",
"शुक्रवार",
"शनिवार"
)
